[
    {
        "eventName": "Blanket Maker in Central, KY area, Quilting, Crocheting, Knitting and No-Sew Fleece Blankets",
        "description": "We make blankets and give them to children and teens who need a reminder that they matter, are not invisible, worthy of love, and that someone cares. Ill, abused, homeless, experiencing trauma. Blankets can be anywhere from 36\"x36\" (preemies and babies) up to a twin-sized blanket, 45\"x60\" (children and teens - those are the ones we ALWAYS NEED - the BIG ONES for BIG K",
        "fullLink": "https://www.volunteermatch.org/search/opp3784789.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Rescue Animal Transporter - Provide animals a ride to freedom",
        "description": "Transport rescue animals from shelters to rescues and fosters. Hours are generally 10am to 4pm. Routes vary but include in and around San Diego County and sometimes Los Angeles/Riverside/Orange County to San Diego. Ideal for someone with a regular route who could fit in animal pickup and drop off and does not need to make stops (animals cannot be left alone in a parked car). This volunteer positi",
        "fullLink": "https://www.volunteermatch.org/search/opp1753401.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Chief Product Officer",
        "description": "Human Health Project (HHP) is a health literacy charity: Our mission is to improve the health of the underserved and vulnerable through holistic information, education and advocacy.Our objective is to empower people to best manage their own health. For more information, please visit our website. HHP is looking for a Chief Product Of",
        "fullLink": "https://www.volunteermatch.org/search/opp3752256.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Online Research - Humanitarian Sector - Africa",
        "description": "Join DAP's amazing team of volunteers to improve the impact of disaster relief and humanitarian aid! We are looking for online researcher to support the following: Identify local Civil Society Organizations (CSOs)/ Non-Governmental Organizations (NGOs) involved in disaster relief & human services. Other online research tasks",
        "fullLink": "https://www.volunteermatch.org/search/opp2687687.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Invasive Plant Removal at Theodore Roosevelt Island",
        "description": "Join us at Theodore Roosevelt Island from 10am to 12pm! We’ll be removing various invasive species and throughout the island to make room for native flora and fauna. Meeting point is at the Pedestrian Bridge located on the Virginia side of the island, though works may be different each month. No skills are required for these events. Notes: Tools and gloves a",
        "fullLink": "https://www.volunteermatch.org/search/opp3884338.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "SEO consultant for Nobel & Laureates Library Online! Many opportunities!",
        "description": "Need SEO consultant for our website www.GangaLib.org Please send your resume including education, work experience and ALL your hobbies/interests, as a simple Microsoft word doc. We shall see as to which aspect of the work would be most interesting and useful to you. If you need a letter for your volunteer work, please inform us prior to commencing work, regarding to whom you",
        "fullLink": "https://www.volunteermatch.org/search/opp3802373.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Volunteer Admissions Intern",
        "description": "We are looking for a woman to help in our Admissions Office, for our Christian Apostolic Academy for women. This is a remote/virtual position and hours are flexible. This Intern will assist our Admissions Office to help answer emails and questions that current students and prospective students have about our Academy and the enrollment process. Skills needed: Abilit",
        "fullLink": "https://www.volunteermatch.org/search/opp3884385.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Seeking Photoshop/Graphic Design/Graphic Designer for Global-Sustainability Nonprofit",
        "description": "One Community is a nonprofit all-volunteer sustainability think tank. Our volunteer team fluctuates between 100-200 team members and has included over 1000 volunteers representing more than 60 different countries. We create open source sustainability-focused components covering food, energy, housing, education, and more. Read the specifics of how and why here:",
        "fullLink": "https://www.volunteermatch.org/search/opp3589481.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Writing Team",
        "description": "The goal of this team focuses on supporting the other teams through your writing skills, and is ideal for you if you want to volunteer mainly through writing. Examples of opportunities for you as a writing team member include:",
        "fullLink": "https://www.volunteermatch.org/search/opp3884382.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "NHQ:ISD - English Language Coach - Latin and Caribbean Division",
        "description": "Purpose: This position directly supports the National Headquarters (NHQ) International Services department (ISD) Latin America and Caribbean Division team. This position will support the Latin America and Caribbean (LAC) Division team strengthen their English language communication skills. This is a 100% virtual (volunteer-from-home) opportunity. Respons",
        "fullLink": "https://www.volunteermatch.org/search/opp3884372.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Start Chapter of Timeless Harmonies",
        "description": "Join the Movement with Timeless Harmonies! Are you passionate about making a difference and spreading joy? Timeless Harmonies invites YOU to start a chapter of our nonprofit organization at your school! As a chapter leader, you'll have the opportunity to: Launch a school club focused on giving back to seniors in your community Lead bi-monthly or m",
        "fullLink": "https://www.volunteermatch.org/search/opp3884354.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Financial Assistance Manager for Breast Cancer Nonprofit",
        "description": "Responsibilities Answer website inquiries about financial aid request ( information and template emails will be provided)",
        "fullLink": "https://www.volunteermatch.org/search/opp3884438.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Healthy Women, Healthy Families: Be a Board Member",
        "description": "Center of Wellness for Urban Women, Inc (CWUW), founded in 2007, empowers women and their families living in urban communities to take an active role in improving their health and well-being through education, advocacy, care, and prevention. We believe in empowering women to learn to maintain the 7 dimensions of Wellness (ph",
        "fullLink": "https://www.volunteermatch.org/search/opp968316.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Help foster youth around Oregon (FULLY REMOTE)",
        "description": "Elysium Sanctuary is an all-volunteer nonprofit that serves foster youth and their families in Oregon. Despite our relatively small size, we serve dozens of families every year! We are currently looking for additional board members and volunteers to help expand our services. Elysium volunteers typically work independently, but we do have occasional meetings via zoom to discuss goals, plan upcom",
        "fullLink": "https://www.volunteermatch.org/search/opp3770216.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Looking for a savvy Grant Writer Volunteer",
        "description": "Please send your resume to this email address: info@girlnowwomanlater.org If you are interested in this position, please. Thank you. Why Girl Now Wo",
        "fullLink": "https://www.volunteermatch.org/search/opp3330282.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Marketer",
        "description": "Responsibilities & Skills: Create, compose, design, and manage direct mail and email campaigns, social media content and our website page. Excellent creative writing skills. Proficient at editing and copywriting.",
        "fullLink": "https://www.volunteermatch.org/search/opp3854667.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Graphic Designer",
        "description": "Are you a creative designer passionate about user experience and graphic design? Do you have a knack for crafting compelling visuals and a keen eye for maintaining design consistency? If so, we have an exciting volunteer opportunity for you! Role Description: We are seeking a talented Graphic Designer with a flair for UX Design to join our team in maintaining our design s",
        "fullLink": "https://www.volunteermatch.org/search/opp3789643.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "CURRICULUM DEVELOPMENT VOLUNTEER AT BUSINESS FOR KIDS",
        "description": "Business for Kids is looking for curriculum development volunteers! Are you a high school or college student interested in business, teaching, and curriculum development? Do you want to gain experience to put on your resume and/or college applications? Do you want to join a network of like-minded students and connect with professionals? Do you want to earn volunteer hours",
        "fullLink": "https://www.volunteermatch.org/search/opp3839802.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "NEW WEBSITE REDESIGN - The On It Foundation",
        "description": "Opportunity Details The On It Foundation - a national 501(c)(3) public non-profit headquartered in Miami, FL, that provides free computers and 22nd Century Skill Sets, (to include STEM / STEAM education), for low-income families with students in grades K-12 that receive a free or reduced school lunch, attend public/home school and reside within the United States. Our mission is nationally",
        "fullLink": "https://www.volunteermatch.org/search/opp3413878.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Development / Grant Writer Volunteer",
        "description": "We are in need of experienced Grant Writers with a successful track record of writing and receiving Government & Foundation funding. The Grant Specialist will be responsible for identifying, securing, and managing grant funding to support the organization's mission and programs. We are a 501(c)3, non-profit whose mission is to teach, support, and empower women and girls globally to f",
        "fullLink": "https://www.volunteermatch.org/search/opp2873260.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Social Media Organizer",
        "description": "PAW is looking for a person who is knowledgeable about Social Media and Marketing to take a leadership role in developing our social media presence. This person will oversee PAW's social media presence, develop a strategy for how to increase engagement online, and work with a team of content creators to grow PAW's social media. This is primarily an online position that can be done virtually.",
        "fullLink": "https://www.volunteermatch.org/search/opp3873925.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Graphic Designer",
        "description": "Soweto Youth Initiative is looking a creative and motivated Graphic Designer to produce engaging, eye-catching, and on-brand digital projects for Instagram, TikTok, Twitter, Facebook, and LinkedIn. The Graphic Designer will be responsible for generating original content using existing brand assets to superpower our impact on social media (and, at times, around the country with print projects). The",
        "fullLink": "https://www.volunteermatch.org/search/opp3661098.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    },
    {
        "eventName": "Program Coordinator Internship Volunteer (Unpaid, BUT Receive School Hours!)",
        "description": "Unpaid Internship Opportunity: Program Coordinator Join Us in Making a Difference! Are you passionate about community service and eager to make a positive impact? [Standup To Our Perpetrators ] is seeking an enthusiastic Program Coordinator with some experience preffered, Intern to support our mission of food recovery and domestic violence assistance. This is an exciting oppo",
        "fullLink": "https://www.volunteermatch.org/search/opp3857838.jsp",
        "datePosted": "Date Posted: January 11, 2025"
    }
]